import React, { useState } from 'react';
import Calendar from 'react-calendar';
import 'react-calendar/dist/Calendar.css';
import './Poyaday.css';


const Poyaday = () => {

    // pdf viewer
    const handleViewPDF = () => {
        window.open(`${process.env.PUBLIC_URL}/Sathara_Sathipattana_Sutta.pdf`, '_blank');
    };
    const [date, setDate] = useState(new Date());

    // Array of Poya Days for 2024
    const poyaDays = [
        { date: new Date(2024, 0, 25), name: 'Duruthu Poya (දුරුතු පොහොය)', poyadetail: 'බුදුරදුන්ගේ ප්‍රථම ලංකාගමනයබුද්ධත්වයෙන් නව මසකට පසු උරුවෙල් දනව්වට වැඩමකල බුදුරදුන් උරුවේල කාශ්‍යප,නදී කාශ්‍යප,ගයා කාශ්‍යප යන තුන්බෑ ජටිලයන් ප්‍රමුඛ 1000 පිරිස සිය දහම් මගට හරවා ගත්හ.පසුව ලක්දිව බිම්තැන්නේ මහවැලි ගඟ අසබඩ මිනිපේ නම් සරු දනව් පියසට ගුවනින් පහලව බුදුරැස් මාලාවන් විහිදුවමින් වැඩහුන් සේක.ලක්දිව ත්‍රිපිටක බුද්ධ ධර්මය ප්‍රථම වරට පුස්තකාරෑඩ කිරීම.' },
        { date: new Date(2024, 1, 24), name: 'Navam Poya (නවම් පොහොය)', poyadetail: 'රජගහ නුවර වේලුවනාරාමයේදී සැරියුත් මුගලන් වහන්සේලා අග්‍ර ශ්‍රාවක තනතුර ලැබීම.තථාගතයන් වහන්සේ විසින් මහා සංඝයාට ඕවාද ප්‍රාතිමෝක්‍ෂය දේශනා කිරිම.බුදුන් වහන්සේ පිරිනිවනට මාස තුනකට ප්‍රථම ආයු සංස්කාරය අත් හැරීම.' },
        { date: new Date(2024, 2, 25), name: 'Medin Poya (මැදින් පොහොය)', poyadetail: 'බුදුරදුන් 20000ක් ආර්ය මහා සංඝයා පිරිවරාගෙන සුද්ධෝධන රජතුමා හා සිය ඥාතීන්ව අමාමහ නිවන්සුව ලබාදෙනු වස් කිඹුල්වත් පුරයට වැඩම කිරීමට ගමනාරම්භය.රහල් කුමරු පැවිදි වීමනන්ද කුමරු පැවිදි වීම' },
        { date: new Date(2024, 3, 23), name: 'Bak Poya (බක් පොහොය)', poyadetail: 'ලක්දිව දෙවන වරට බුදු සිරිපා පහසින් පිවිතුරු බවට පත්වූයේත්, බුදුරදුන්ගේ සවනක් රැස් කඳින් මුළු හෙළදිව ආලෝකමත් වූයේත් දහම් අමා මිහිරෙන් නොයෙක් දෙනා නිවී සැනසී ගියේත් මේ පොහෝදා වේ.බුදුරදුන් ලක්දිව නාගදීපයට වැඩමකොට මැණික් පුටුවට යුද වදිමින් සිටි චූ⁣ලෝදර - මහෝදර නා රජුන් දෙදෙනාට ධර්ම දේශනා කොට ඔවුන් සාමදාන කිරීම.සතර පෙරනිමිතිවලින් පළමු පෙරනිමිත්ත සිදුහත් කුමරු ඇස ගැටීම.' },
        { date: new Date(2024, 4, 23), name: 'Vesak Poya (වෙසක් පොහොය)', poyadetail: 'සිද්ධාර්ථ කුමාරයාගේඉපදීම, සිද්ධාර්ථ තාපසයාගේබුදුවීම, සහ බුදුන් වහන්සේ ගේපරිනිර්වානය යන අසිරිමත් මංගල කරුණු රැසකින් පූජනීයත්වයටත්,ඓතිහාසිකත්වයටත් පත් වූ වෙසක් දිනය බෞද්ධ ජනතාවගේ පරම පූජනීය ආගමික දිනයක් වීම.දීපංකර බුදුරදුන් හමුවේ සම්මා සම්බුද්ධ පදවිය සඳහා ගෞතම බුදුරදුන් නියත විවරණ ලැබීම.කිසාගෝතමී දේවිය විසින් "නිබ්බුතා නූන සා මාතා"යන නිබ්බුත පද පැවසීම.බුදුවීමෙන් පසු ප්‍රථම වරට කිඹුල්වත් පුරයට පැමිණ යමාමහ පෙළහර පෑම.බුද්ධත්වයෙන් අටවන වර්ෂයේ මනිඅක්ඛිත නාරදුගේ ඇරයුමෙන් කැලණියට වැඩීම,එදවසම සුමන සමන් දෙව්රදුන්ගේ ඇරයුමින් සමනළ පව්වට වැඩම කොට බුදුසිරිපා පිහිටුවා තෙවන වරටත් සිරිලක පුන්‍ය භූමියක් බවට පත් කිරීම.විජය කුමරු ලංකාවට පැමිනීම.පිරිනිවන් මංචකයේ සැතපී සිටි බුදුරදුන් වෙත පැමිනි සක්දෙව් රදුට ලංකාවත්සිංහලජාතියත් රක්නා ලෙස පැවරීම.දෙවනපෑතිස් රජු ධර්මාශෝක චක්‍රවර්තීන් විසින් තිළිණකොට එවන ලද පංච කකුධ භාණ්ඩයන් සහිතව නියම උදාර රජකු ලෙස ද්විතීයාභිශේක ලැබීම.අනුරපුර මහමෙවුනා උයනේ රුවන්වැලි සෑ රදුන් සැදීමට වීසා නැකතින් වැඩ ඇරඹීම.ආනන්ද හිමියන් පිරිනිවන් පෑමමහා විහාරවංශික භික්‍ෂූන්ගේ වර්ෂයක් පාසා පවත්වනු ලබන උපසම්පදා මහෝත්සවය ප්‍රථමවරට පැවැත්වීම.ශ්‍රී ලංකාවේ සිංහල බෞද්ධ රජවරුන්ගේ අභිෂේකය සිදුකිරීම.' },
        { date: new Date(2024, 5, 21), name: 'Poson Poya (පොසොන් පොහොය)', poyadetail: 'අනුබුදු මහාමිහිදු මහරහතන් වහන්සේ ප්‍රමුඛ ඉට්ඨිය,උත්තිය,සම්බල,බද්දසාල යන රහතන් වහන්සේලාත්,ෂඩ් අභිඥාලාභී සුමන සාමනේරයන්ද,භණ්ඩුක නම් අනාගාමී උපාසකවරයා යන පිරිස ධර්මවිජය පිළිබඳ අනගිතම පනිවිඩය මූර්ථිමත් කරමින් ශාන්තීය දූතයන් වශයෙන් ලංකාකවේ උතුරුමැද නිම්නයේ අනුරපුර මිස්සක පව්වට වැඩමකර බු:ව 236 දී ලක්දිව බුදුසසුන පිහිටුවීම.බුදු වී සිව්වන සතියේ රුවන්ගෙයි වැඩහිඳිමින් ධර්මය මෙනෙහි කරන බුදුරදුන්ගේ ශරීරයෙන් ප්‍රථම වරට සවනක් ඝණ බුදුරැස් විහිදීම.ලක්දිව ප්‍රථම මහණ උපසම්පදාව වන භණ්ඩුක උපාසක මහණ උපසම්පදාව සිදුවීම.දෙවනපෑතිස් රජු ඇතුළු 40,000 ක් පිරිස චුල්ල හත්ථිපදෝපම  සූත්‍රය අසා තෙරුවන් සරණ යාම' },
        { date: new Date(2024, 6, 21), name: 'Esala Poya (ඇසළ පොහොය)', poyadetail: 'සිදුහත් කුමරු මව්කුස පිළිසිඳ ගැනීමසිදුහත් කුමුරු අභිනිෂ්ක්‍රමණය කිරීම.රාහුල කුමරුගේ උපත.බරණැස් පුර ඉසිපතනාරාමයේදී පස්වග මහනුන්ට දම්සක් පැවතුම් සූත්‍රය දේශනා කිරීම.ගණෟඩබ්බ රුක්මුල්හිදී ථීරථකයන්ගේ මානය මර්ධනය කිරීමට යමාමහ පෙළහර පෑම.මාතා දිව්‍යරාජයා ඇතුළු දෙවියන්ට විජයම්බණ දේශනා කිරීම.ප්‍රථම ධර්ම සංඝායනාව පැවැත්වීමට රජගහ නුවරට වැඩමකර වස් එලැඹ මූලික කටයුතු ඇරඹීම.ප්‍රථම ඛණ්ඩ සීමාව සාම්ගීත කිරීම.අරිෂෟඨ කුමරු ප්‍රධාන සිංහලයන් සපනස් දෙනාගේ මහණ උපසම්පදාව තුම්බුරු සීමා මාලකයේදී සිදු කිරීම.ලංකාවේ දෙසැටක් රහතන් වහන්සේලාගේ ප්‍රථම වස්සූපගමනය.බු.ව 382 දී දුටුගැමුණු රජු විසින්රුවන්වැලි සෑ රදුන් තනන්නට මගුල් ගල තැබීම.මහ සෑයේ ධාතු නිධානය අනේප්‍රකාර ප්‍රාතිහාර්ය මැද සිදුවීම.කීර්ති ශ්‍රී මේඝවර්ණ රජ(කිත්සිරි මෙවන්) දවස කලිඟු රටින් හේමමාලා කුමරිය හා දන්ත කුමරු විසින් ලංකාවට ගෙනෙන ලද දළදා වහන්සේ ප්‍රදර්ශනය කරමින් වර්ෂයක් පාසා පවත්වනු ලබන ඇසළ පෙරහැරේ ආරම්භය.ලක්දිව සාමනේර හිමිවරුන්ට උපසම්පදාව ලබා දීම.' },
        { date: new Date(2024, 7, 19), name: 'Nikini Poya (නිකිණි පොහොය)', poyadetail: 'වස් එළඹීම ඇරඹීම.ආනන්ද හිමියන් රහත් වීම.අජාසත් රජුගේ දායකත්වයෙන් රජගහ නුවරදී පළමු ධර්ම සංගායනාව පැවැත්වීම.බුදුරජාණන් වහන්සේගේ ලලාට ධාතුන්වහන්සේ නිදන් කොට සේරුවිල මංගල චෛත්‍යරාජයා තැනීම ආරම්භ කිරීම.' },
        { date: new Date(2024, 8, 17), name: 'Binara Poya (බිනර පොහොය)', poyadetail: 'මෙහෙනි සස්නේ ආරම්භය.බුදුරදුන් විශාලා මහනුවර කූටාගාර ශාලාවේ වැඩ වෙසෙන සමයේ මහා ප්‍රජාපතී ගෝතමී දේවිය රෝහිනී නදී තීරයේදී පැවිදි වූ කුමරුවන්ගේ භාර්යාවන් 500 දෙනා සමඟ කෙස් සිඳ, කසාවත් හැඳ කිඹුල්වත් පුරයේ සිට පා ගමනින්ම විශාලා මහනුවරට පැමිණියාය.අනඳ හිමියන්ගේ මාර්ගයෙන් කාන්තාවන්ට සසුන් පැවිද්ද දෙනලෙස ඉල්ලා සිටියහ.අනඳ හිමි බුදුරදුන්ට මේ බව සැලකලද උන්වහන්සේ තෙවරක්ම එම ඉල්ලීම ප්‍රතික්‍ෂේප කළහ.පසුව අනඳ හිමිගේ බලවත් උත්සාහය මත කරුණු පහදා දී මහා ප්‍රජාපතී ගෝතමිය ප්‍රධාන කාන්තාවන්ට සසුන් දොර විවෘත විය.පැවිද්ද අවශ්‍යනම් අෂ්ඨගරු ධර්ම පිළිගත යුතුය,එයම ඇයට පැවිද්ද හා උපසම්පදාව වන්නේයි බුදුරදුන් ප්‍රකාශ කලහ.එය පිළිගෙන එවලෙහිම පැවිද්ද හා උපසම්පදාව ලැබීය.' },
        { date: new Date(2024, 9, 17), name: 'Vap Poya (වප් පොහොය)', poyadetail: 'සත්වන වස් කාලය ගතකිරීමට තව්තිසා දෙව්ලොවට වැඩම කෙරූ බුදුන් වහන්සේ දෙව්ලොවින් නික්ම දඹදිව සකස්පුරයට පැමිණ මහා පෙළහර පාමින් වැඩ සිටි සේක.සැරියුත් හිමියන් ප්‍රඥාලාභී භික්‍ෂූන් අතර අග්‍රස්ථානය ලැබීම.කල්ප ලක්‍ෂයකින් මතුයෙහි බුදුවීමට සිටින මෛත්‍රී බෝසතානන් ගෞතම බුදුරදුන්ගේ ශාසනයෙහි පැවිදි වීම.අනුලා දේවිය ඇතුළු කුල කතුන් සසුන්ගත කිරීමට සංඝමිත්තා තෙරණිය ඇතුළු භක්‍ෂුණී සංඝයාත්,ජය ශ්‍රී මහා බෝධි ධාමයේ දක්‍ෂිණ ශාඛාවත් ලක්දිවට වැඩමවා ගැනීමට අනුබුදු මිහිදු හිමියන්ගේ නියමයෙන් දෙවනපෑතිස් රජුගේ සංදේශයත් සතුටු පඬුරුත් රැ‍ගෙන අරිෂ්ඨ කුමරු ප්‍රමුඛ රාජකීය දූත පිරිස දඹදිව සැලලුප් නුවර ධර්මාශෝක චක්‍රවර්තීන් හමුවීමට පිටත්කොට යවන ලද්දේ වප් පෝ දායි.මහාරිෂ්ඨ මහ රහතන් වහන්සේ විසින් ලංකා ශාසන ඉතිහාසයේ අමරණිය සිද්ධයක් වන විනය පිටකය සංඝායනා කිරීම.' },
        { date: new Date(2024, 10, 15), name: 'Ill Poya (ඉල් පොහොය)', poyadetail: 'මෛත්‍රී බෝධිසත්වයන් ‍ගෞතම බුදුරදුන්ගෙන් විවරණ ලැබීම.ප්‍රථම ධර්මදූත පිරිස වන රහත් හැටනමගේ ධර්ම ප්‍රචාරය සඳහා ගමනාරම්භ කිරීම.බුදුරදුන් තුන්බෑ ජටිලයන් දමනය කිරීමට උරුවෙල් දනව්වට වැඩම කිරීම.පසුවස් ප්‍රාවරණය කලයුතු දිනය වීම.චීවර මාසයේ අන්තිම පොහොය එනම් කඨිනාස්කරණ විනය කර්මය කළහැකි අවසන් දිනය වීම.අගසව් සැරියුත් මාහිමියන් පිරිනිවන් පෑම.ථූපාරාම චෛත්‍යය ඉදිකිරීම.' },
        { date: new Date(2024, 11, 14), name: 'Unduvap Poya (උඳුවප් පොහොය)', poyadetail: 'සංඝමිත්තා තෙරණිය ඇතුළු පිරිස ශ්‍රී මහා බෝධියේ දක්‍ෂිණ ශාඛාවද රැගෙන ලක්දිව දඹකොළ පටුනට පැමිණීම.මුඟලන් තෙරුන් පිරිනිවන් පෑම.සිරිපා වන්දනාව ආරම්භ කරන පොහොය වීම.' },
    ];

    const monthlypoya = [  //monthly poyadays without fullmoon poya
        new Date(2024, 7, 3), // August 1, 2024
        new Date(2024, 7, 15), // August 15, 2024
        new Date(2024, 7, 20), // August 20, 2024
    ];

    const getUpcomingPoyaDay = () => {
        const today = new Date();
        // Find the next Poya Day
        const upcomingPoyaDay = poyaDays.find(d => d.date > today);
        return upcomingPoyaDay;
    };

    const upcomingPoyaDay = getUpcomingPoyaDay();
    const isSameMonth = (a, b) =>
        a.getFullYear() === b.getFullYear() && a.getMonth() === b.getMonth();

    const isSameDay = (a, b) =>
        a.getFullYear() === b.getFullYear() &&
        a.getMonth() === b.getMonth() &&
        a.getDate() === b.getDate();

    // Find any Poya Day in the selected month
    const monthPoyaDays = poyaDays.filter(d => isSameMonth(d.date, date));


    const formatDateInSinhala = (date) => {
        // Define Sinhala month names
        const months = [
            'ජනවාරි', 'පෙබරවාරි', 'මාර්තු', 'අප්‍රේල්', 'මැයි', 'ජුනි', 'ජුලි', 'අගෝස්තු', 'සැප්තැම්බර්', 'ඔක්තෝබර්', 'නොවැම්බර්', 'දෙසැම්බර්'
        ];

        // Define Sinhala day names
        const days = [
            'සෙනසුරාදා', 'ඉරිදා', 'සඳුදා', 'අඟහරුවාදා', 'බ්‍රහස්පතින්දා', 'සිකුරාදා', 'සෙනසුරාදා'
        ];

        const dayNames = ['ඉරිදා', 'සඳුදා', 'අඟහරුවාදා', 'බ්‍රහස්පතින්දා', 'සිකුරාදා', 'සෙනසුරාදා', 'ඉරිදා'];

        // Create a new Intl.DateTimeFormat instance with Sinhala locale
        const formatter = new Intl.DateTimeFormat('si-LK', {
            weekday: 'long',
            year: 'numeric',
            month: 'long',
            day: 'numeric',
        });

        // Format date
        const formattedDate = formatter.format(date);

        // Replace the English month and day names with Sinhala names
        const [day, month, year] = formattedDate.split(' ');

        // Map the month and day names to Sinhala
        const sinhalMonth = months[new Date(date).getMonth()];
        const sinhalDay = days[new Date(date).getDay()];



        return `${sinhalDay}, ${new Date(date).getDate()} ${sinhalMonth}`;
    };


    return (

        <div>
            <div className="text-left">
                <h4>පෝදා</h4><h4 className="yellow">වැඩසටහන</h4>
            </div>
            <div className='app-poya'>
                <div className='poya-details'>
                    <div className='calendar-container'>
                        <Calendar
                            onChange={setDate}
                            value={date}
                            tileClassName={({ date, view }) => {
                                if (view === 'month' && poyaDays.some(d => isSameDay(d.date, date))) {
                                    return 'highlight'; // Highlight only Poya Days
                                }
                                else {
                                    if (view === 'month' && monthlypoya.some(d => isSameDay(d, date))) {
                                        return 'highlight-monthlypoya'; // Highlight only Poya Days
                                    }
                                }
                            }}

                        />

                    </div>
                    <div>

                    </div>
                    <div className='poyaday-content'>
                        <div className='button-container'>
                            <button className='button-t' onClick={handleViewPDF}>සතර සතිපට්ඨාන සූත්‍රය</button>
                        </div>

                        <h5>
                            {monthPoyaDays.length > 0
                                ? `${monthPoyaDays.map(day => `${day.name} (${formatDateInSinhala(day.date)})`).join(', ')}`
                                : 'මෙම මාසයේ කිසිදු පෝය දිනයක් නැත'}
                        </h5>
                        <hr />
                        <p>
                            <span>▣ </span>{monthPoyaDays.length > 0
                                ? monthPoyaDays.map(day => day.poyadetail).join(' ')
                                : 'No Poya Days in this month'}
                        </p>
                        <div className='upcomming-poya '>
                            <p className='text-center'>
                                <span className='bold'>මීලඟ පෝය දිනය:</span> {upcomingPoyaDay ? `${upcomingPoyaDay.name} (${upcomingPoyaDay.date.toDateString()})` : 'No upcoming Poya Day'}
                            </p>

                        </div>


                    </div>
                </div>
                <div className='time-table'>
                    <div className='tables-wrapper'>
                        <div className='poya-timetable'>
                            <h3 className='text-center'>පුර පසලොස්වක පෝය දොලහට සිල් ඇත්තන් සඳහා දානය ලබාදෙන සුපින්වතුන්</h3>
                            <hr />
                            <div className='table-container'>
                                <table className="table custom-sinhala-table-danaya">
                                    <thead>
                                        <tr className="thead-table">
                                            <th scope="col">මාසය</th>
                                            <th scope="col">උදෑසන දානය</th>
                                            <th scope="col">දහවල දානය</th>
                                            <th scope="col">සවස ගිලන්පස දානය</th>
                                        </tr>
                                    </thead>
                                    <tbody>
                                        <tr>
                                            <th scope="row">06.30-07.15</th>
                                            <td>උදෑසන සම්බුද්ධ පූජාව පූජා කිරීම.</td>
                                            <td>උදෑසන සම්බුද්ධ පූජාව පූජා කිරීම.</td>
                                            <td>උදෑසන සම්බුද්ධ පූජාව පූජා කිරීම.</td>
                                        </tr>
                                        <tr>
                                            <th scope="row">07.15-08.00</th>
                                            <td>උදේ ධානය ලබා ගැනීම.</td>
                                            <td>උදෑසන සම්බුද්ධ පූජාව පූජා කිරීම.</td>
                                            <td>උදෑසන සම්බුද්ධ පූජාව පූජා කිරීම.</td>
                                        </tr>
                                        <tr>
                                            <th scope="row">08.00-10.30</th>
                                            <td>සතර සතිපට්ඨාන දේශනාව ඇසුරෙන් ධර්ම සාකච්චාව සිදු කිරීම.</td>
                                            <td>උදෑසන සම්බුද්ධ පූජාව පූජා කිරීම.</td>
                                            <td>උදෑසන සම්බුද්ධ පූජාව පූජා කිරීම.</td>
                                        </tr>
                                        <tr>
                                            <th scope="row">10.30-11.00</th>
                                            <td>දහවල සම්බුද්ධ පූජාව පූජා කිරීම.</td>
                                            <td>උදෑසන සම්බුද්ධ පූජාව පූජා කිරීම.</td>
                                            <td>උදෑසන සම්බුද්ධ පූජාව පූජා කිරීම.</td>
                                        </tr>
                                        <tr>
                                            <th scope="row">11.00-12.00</th>
                                            <td>දහවල දානය ලබා ගැනීම.</td>
                                            <td>උදෑසන සම්බුද්ධ පූජාව පූජා කිරීම.</td>
                                            <td>උදෑසන සම්බුද්ධ පූජාව පූජා කිරීම.</td>
                                        </tr>
                                        <tr>
                                            <th scope="row">12.00-01.00</th>
                                            <td>විවේක කාලය (වතාවත් සඳහා).</td>
                                            <td>උදෑසන සම්බුද්ධ පූජාව පූජා කිරීම.</td>
                                            <td>උදෑසන සම්බුද්ධ පූජාව පූජා කිරීම.</td>
                                        </tr>
                                        <tr>
                                            <th scope="row">01.00-02.00</th>
                                            <td>පිරිත් සජ්ජායනය කිරීම( සතර සතිපට්ඨාන සූත්‍රය).</td>
                                            <td>උදෑසන සම්බුද්ධ පූජාව පූජා කිරීම.</td>
                                            <td>උදෑසන සම්බුද්ධ පූජාව පූජා කිරීම.</td>
                                        </tr>
                                        <tr>
                                            <th scope="row">02.00-03.30</th>
                                            <td>ධර්ම දේශනාව පැවැත්වීම.</td>
                                            <td>උදෑසන සම්බුද්ධ පූජාව පූජා කිරීම.</td>
                                            <td>උදෑසන සම්බුද්ධ පූජාව පූජා කිරීම.</td>
                                        </tr>
                                        <tr>
                                            <th scope="row">03.30-05.00</th>
                                            <td>සතර සතිපට්ඨාන දේශනාව ඇසුරෙන් ධර්ම සාකච්චාව සිදු කිරීම.</td>
                                            <td>උදෑසන සම්බුද්ධ පූජාව පූජා කිරීම.</td>
                                            <td>උදෑසන සම්බුද්ධ පූජාව පූජා කිරීම.</td>
                                        </tr>
                                        <tr>
                                            <th scope="row">05.00</th>
                                            <td>සිල් පවාරනය සිදු කිරීම සඳහා පන්සිල් සමාදන් වීම.</td>
                                            <td>උදෑසන සම්බුද්ධ පූජාව පූජා කිරීම.</td>
                                            <td>උදෑසන සම්බුද්ධ පූජාව පූජා කිරීම.</td>
                                        </tr>
                                        <tr>
                                            <th scope="row">06.30</th>
                                            <td>අෂ්ඨපාන සහිත සම්බුද්ධ පූජාව පූජා කිරීම.</td>
                                            <td>උදෑසන සම්බුද්ධ පූජාව පූජා කිරීම.</td>
                                            <td>උදෑසන සම්බුද්ධ පූජාව පූජා කිරීම.</td>
                                        </tr>
                                        <tr>
                                            <th scope="row" className='final-row'></th>
                                            <td className='final-row'>***දිනයේ නිමාව***</td>
                                            <td>උදෑසන සම්බුද්ධ පූජාව පූජා කිරීම.</td>
                                            <td>උදෑසන සම්බුද්ධ පූජාව පූජා කිරීම.</td>
                                        </tr>
                                    </tbody>
                                </table>
                            </div>
                        </div>

                        <div className='daana-timetable'>
                            <h3 className='text-center'>පෝයදින කාලසටහන</h3>
                            <hr />
                            <div className='table-container'>
                                <table className="table custom-sinhala-table">
                                    <thead>
                                        <tr className="thead-table">
                                            <th scope="col">වේලාව</th>
                                            <th scope="col">අදාළ කාර්‍යය</th>
                                        </tr>
                                    </thead>
                                    <tbody>
                                        <tr>
                                            <th scope="row">06.30-07.15</th>
                                            <td>උදෑසන සම්බුද්ධ පූජාව පූජා කිරීම.</td>
                                        </tr>
                                        <tr>
                                            <th scope="row">07.15-08.00</th>
                                            <td>උදේ ධානය ලබා ගැනීම.</td>
                                        </tr>
                                        <tr>
                                            <th scope="row">08.00-10.30</th>
                                            <td>සතර සතිපට්ඨාන දේශනාව ඇසුරෙන් ධර්ම සාකච්චාව සිදු කිරීම.</td>
                                        </tr>
                                        <tr>
                                            <th scope="row">10.30-11.00</th>
                                            <td>දහවල සම්බුද්ධ පූජාව පූජා කිරීම.</td>
                                        </tr>
                                        <tr>
                                            <th scope="row">11.00-12.00</th>
                                            <td>දහවල දානය ලබා ගැනීම.</td>
                                        </tr>
                                        <tr>
                                            <th scope="row">12.00-01.00</th>
                                            <td>විවේක කාලය (වතාවත් සඳහා).</td>
                                        </tr>
                                        <tr>
                                            <th scope="row">01.00-02.00</th>
                                            <td>පිරිත් සජ්ජායනය කිරීම( සතර සතිපට්ඨාන සූත්‍රය).</td>
                                        </tr>
                                        <tr>
                                            <th scope="row">02.00-03.30</th>
                                            <td>ධර්ම දේශනාව පැවැත්වීම.</td>
                                        </tr>
                                        <tr>
                                            <th scope="row">03.30-05.00</th>
                                            <td>සතර සතිපට්ඨාන දේශනාව ඇසුරෙන් ධර්ම සාකච්චාව සිදු කිරීම.</td>
                                        </tr>
                                        <tr>
                                            <th scope="row">05.00</th>
                                            <td>සිල් පවාරනය සිදු කිරීම සඳහා පන්සිල් සමාදන් වීම.</td>
                                        </tr>
                                        <tr>
                                            <th scope="row">06.30</th>
                                            <td>අෂ්ඨපාන සහිත සම්බුද්ධ පූජාව පූජා කිරීම.</td>
                                        </tr>
                                        <tr>
                                            <th scope="row" className='final-row'></th>
                                            <td className='final-row'>***දිනයේ නිමාව***</td>
                                        </tr>
                                    </tbody>
                                </table>
                            </div>
                        </div>

                    </div>
                </div>

            </div>

        </div>
    );
};

export default Poyaday;
