import React, { Component } from 'react';
import './History.css'; // Import the CSS file

export default class History extends Component {
    render() {
        return (
            <div>
                <div>
                    <div className="text-left">
                        <h4>පන්සලේ</h4><span> </span><h4 className="yellow">උරුමය</h4>
                    </div>
                    <div className='legacy-pg'>


                        <div className='about-pg'>
                            <p className="about-text">
                                ශ්‍රී ලංකාව බහු සංස්කෘතික සහ බහු ආගම් ගමනාන්තයක් වශයෙන් ප්‍රකට එකක් වන අතර, එහි විවිධත්වය එරට සංස්කෘතික උරුමය, කලා, නාට්‍ය හා සංගීතයේදී හෝ, සිරිත් විරිත් වලදී හෝ ඉතා විශාල ලෙස දැක්වේ. ශ්‍රී ලංකාවට විශිෂ්ට වූ ඉතිහාසයක් තිබේ. එය යුනෙස්කෝ සංරක්ෂණය කළ පැරණි නගරවල්, කෙලෑ, යාය සහ බොදු අයුතුයන්හිදී දක්නට ලැබේ. ඉන්දියානු සාගරයෙහි මුහුදු වෙරළ පිටිපස්සේ, හරිත වනාන්තර, තේ කඳුකර, සෙරසම් බිම් සහ මැටි ගල් වලින් සෑදූ විශාල ගල් පර්වතකයන්, දේශගුණවලට, සත්ව විශේෂවලට, හා ශාක සම්ප්‍රාප්තියට යටත්ව ශ්‍රී ලංකාව භූමිගතවී ඇත.

                                ශ්‍රී ලංකාව, සුවිශේෂී හෙවත් සෑම විටම නොපෙනෙන පලාතක් සමඟින්, පුංචි දූපතක් වුවද, එහි සුන්දරත්වය හා විශිෂ්ටත්වය හෝකූරුවන්ගේ හෙරීටෙජ් සාම්ප්‍රදායික සුදුස්සක් ලෙස පැවසිය හැකිය. කලා විශාරදයන්ගේ මෙන්ම විවිධ කලා විශාරදයන්ගේ නිර්මාණයන්හිදී දක්නට ලැබෙන විශිෂ්ටත්වය, එය කලාකරුවන්ගේ නිර්මාණශීලීත්වයට සහ ප්‍රාචීනත්වයට සාක්ෂියක් ලෙස පෙනේ.

                                කලා සහ සංස්කෘතික උරුමයන් හඳුනා ගැනීම ශ්‍රී ලංකාවට විශේෂය. ඔවුන්ගේ කලා සම්ප්‍රදායන් සහ සංස්කෘතික උරුමයන් ගැන ඉතා ප්‍රාමණිකව කතා කරන එරට ජනතාව, ඔවුන්ගේ දිගු ඉතිහාසයට සහ උරුමයට ගරුකමක් පළ කරයි. ශ්‍රී ලංකාවෙහි බොහෝ ප්‍රදේශයන්හිදී, අනුන්ගේ සංස්කෘතික උරුමයන් හඳුනා ගැනීමට සහ ගරු කිරීමට විවිධාකාරයන්හි වෑයමක් දක්නට ලැබේ.

                                <div className='img-legacy'>
                                    <img src='/legacy-pic.jpg' alt='legacy-pic'  style={{width:"200px"}}/>
                                </div>
                                ශ්‍රී ලංකාව බහු සංස්කෘතික සහ බහු ආගම් ගමනාන්තයක් වශයෙන් ප්‍රකට එකක් වන අතර, එහි විවිධත්වය එරට සංස්කෘතික උරුමය, කලා, නාට්‍ය හා සංගීතයේදී හෝ, සිරිත් විරිත් වලදී හෝ ඉතා විශාල ලෙස දැක්වේ. ශ්‍රී ලංකාවට විශිෂ්ට වූ ඉතිහාසයක් තිබේ. එය යුනෙස්කෝ සංරක්ෂණය කළ පැරණි නගරවල්, කෙලෑ, යාය සහ බොදු අයුතුයන්හිදී දක්නට ලැබේ. ඉන්දියානු සාගරයෙහි මුහුදු වෙරළ පිටිපස්සේ, හරිත වනාන්තර, තේ කඳුකර, සෙරසම් බිම් සහ මැටි ගල් වලින් සෑදූ විශාල ගල් පර්වතකයන්, දේශගුණවලට, සත්ව විශේෂවලට, හා ශාක සම්ප්‍රාප්තියට යටත්ව ශ්‍රී ලංකාව භූමිගතවී ඇත.

                                ශ්‍රී ලංකාව, සුවිශේෂී හෙවත් සෑම විටම නොපෙනෙන පලාතක් සමඟින්, පුංචි දූපතක් වුවද, එහි සුන්දරත්වය හා විශිෂ්ටත්වය හෝකූරුවන්ගේ හෙරීටෙජ් සාම්ප්‍රදායික සුදුස්සක් ලෙස පැවසිය හැකිය. කලා විශාරදයන්ගේ මෙන්ම විවිධ කලා විශාරදයන්ගේ නිර්මාණයන්හිදී දක්නට ලැබෙන විශිෂ්ටත්වය, එය කලාකරුවන්ගේ නිර්මාණශීලීත්වයට සහ ප්‍රාචීනත්වයට සාක්ෂියක් ලෙස පෙනේ.

                                කලා සහ සංස්කෘතික උරුමයන් හඳුනා ගැනීම ශ්‍රී ලංකාවට විශේෂය.ශ්‍රී ලංකාව බහු සංස්කෘතික සහ බහු ආගම් ගමනාන්තයක් වශයෙන් ප්‍රකට එකක් වන අතර, එහි විවිධත්වය එරට සංස්කෘතික උරුමය, කලා, නාට්‍ය හා සංගීතයේදී හෝ, සිරිත් විරිත් වලදී හෝ ඉතා විශාල ලෙස දැක්වේ. ශ්‍රී ලංකාවට විශිෂ්ට වූ ඉතිහාසයක් තිබේ. එය යුනෙස්කෝ සංරක්ෂණය කළ පැරණි නගරවල්, කෙලෑ, යාය සහ බොදු අයුතුයන්හිදී දක්නට ලැබේ. ඉන්දියානු සාගරයෙහි මුහුදු වෙරළ පිටිපස්සේ, හරිත වනාන්තර, තේ කඳුකර, සෙරසම් බිම් සහ මැටි ගල් වලින් සෑදූ විශාල ගල් පර්වතකයන්, දේශගුණවලට, සත්ව විශේෂවලට, හා ශාක සම්ප්‍රාප්තියට යටත්ව ශ්‍රී ලංකාව භූමිගතවී ඇත.

                                ශ්‍රී ලංකාව, සුවිශේෂී හෙවත් සෑම විටම නොපෙනෙන පලාතක් සමඟින්, පුංචි දූපතක් වුවද, එහි සුන්දරත්වය හා විශිෂ්ටත්වය හෝකූරුවන්ගේ හෙරීටෙජ් සාම්ප්‍රදායික සුදුස්සක් ලෙස පැවසිය හැකිය. කලා විශාරදයන්ගේ මෙන්ම විවිධ කලා විශාරදයන්ගේ නිර්මාණයන්හිදී දක්නට ලැබෙන විශිෂ්ටත්වය, එය කලාකරුවන්ගේ නිර්මාණශීලීත්වයට සහ ප්‍රාචීනත්වයට සාක්ෂියක් ලෙස පෙනේ.

                                කලා සහ සංස්කෘතික උරුමයන් හඳුනා ගැනීම ශ්‍රී ලංකාවට විශේෂය.ශ්‍රී ලංකාව බහු සංස්කෘතික සහ බහු ආගම් ගමනාන්තයක් වශයෙන් ප්‍රකට එකක් වන අතර, එහි විවිධත්වය එරට සංස්කෘතික උරුමය, කලා, නාට්‍ය හා සංගීතයේදී හෝ, සිරිත් විරිත් වලදී හෝ ඉතා විශාල ලෙස දැක්වේ. ශ්‍රී ලංකාවට විශිෂ්ට වූ ඉතිහාසයක් තිබේ. එය යුනෙස්කෝ සංරක්ෂණය කළ පැරණි නගරවල්, කෙලෑ, යාය සහ බොදු අයුතුයන්හිදී දක්නට ලැබේ. ඉන්දියානු සාගරයෙහි මුහුදු වෙරළ පිටිපස්සේ, හරිත වනාන්තර, තේ කඳුකර, සෙරසම් බිම් සහ මැටි ගල් වලින් සෑදූ විශාල ගල් පර්වතකයන්, දේශගුණවලට, සත්ව විශේෂවලට, හා ශාක සම්ප්‍රාප්තියට යටත්ව ශ්‍රී ලංකාව භූමිගතවී ඇත.

                                ශ්‍රී ලංකාව, සුවිශේෂී හෙවත් සෑම විටම නොපෙනෙන පලාතක් සමඟින්, පුංචි දූපතක් වුවද, එහි සුන්දරත්වය හා විශිෂ්ටත්වය හෝකූරුවන්ගේ හෙරීටෙජ් සාම්ප්‍රදායික සුදුස්සක් ලෙස පැවසිය හැකිය. කලා විශාරදයන්ගේ මෙන්ම විවිධ කලා විශාරදයන්ගේ නිර්මාණයන්හිදී දක්නට ලැබෙන විශිෂ්ටත්වය, එය කලාකරුවන්ගේ නිර්මාණශීලීත්වයට සහ ප්‍රාචීනත්වයට සාක්ෂියක් ලෙස පෙනේ.

                                කලා සහ සංස්කෘතික උරුමයන් හඳුනා ගැනීම ශ්‍රී ලංකාවට විශේෂය.
                            </p>
                        </div>

                        {/* <div className='img-leagcy'>
                            <img src='/legacy-pic.jpg' alt='legacy-pic'  />

                        </div> */}

                    </div>


                </div>
            </div>
        );
    }
}
